# Cleaning up messy data

## Objectives:
- Find and remove rows with null values
- Harmonize variations of the same categorical value

### Import dependencies

In [17]:
import pandas as pd

### Load the data file

In [18]:
# Identify the path to the file
file = 'Resources/donors2008.csv'

# The correct encoding must be used to read the CSV in pandas
df = pd.read_csv(file, encoding="ISO-8859-1")

### Preview the DataFrame
Note that **FIELD8** is likely a meaningless column

In [19]:
df.head()

  LastName FirstName          Employer      City State    Zip  Amount  FIELD8
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0     NaN
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0     NaN
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0     NaN
3    Adams  Lorraine              Self  New York    NY  10026   200.0     NaN
4    Adams    Marion              None    Exeter    NH  03833   100.0     NaN

### Identify which columns contain null values

The below code is performing two tasks:
- First, it is checking every cell to see if it's null, an returning a True/False for each cell.
- Then, it is checking each column to see if **any** of that column's values are **True**

In [20]:
df.isnull().any()

LastName     False
FirstName    False
Employer      True
City         False
State        False
Zip          False
Amount       False
FIELD8        True
dtype: bool

### Identify rows with incomplete data

In [21]:
df.count()

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
FIELD8          0
dtype: int64

In [24]:
# Delete extraneous column
del df['FIELD8']
df.head()

  LastName FirstName          Employer      City State    Zip  Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0
3    Adams  Lorraine              Self  New York    NY  10026   200.0
4    Adams    Marion              None    Exeter    NH  03833   100.0

### Look at the rows that contain at least one null value

- **NOTE:** Similar to how we used `df.isnull().any()` in the cell above, we looking for **any** existence of a null value. Previously, we were looking for the **columns** that contained a null value. In the code below, we're passing the argument `axis=1` to check for the **rows** that contain a null value.

In [25]:
df.isnull().any(axis=1)

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13       True
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1746    False
1747    False
1748    False
1749    False
1750    False
1751    False
1752    False
1753    False
1754    False
1755    False
1756    False
1757    False
1758    False
1759    False
1760    False
1761    False
1762    False
1763    False
1764    False
1765    False
1766    False
1767    False
1768    False
1769    False
1770    False
1771    False
1772     True
1773     True
1774    False
1775    False
Length: 1776, dtype: bool

In [26]:
df.loc[df.isnull().any(axis=1)]

          LastName FirstName Employer           City State         Zip  Amount
13           Ahuja  Maria T.      NaN       New York    NY       10021  1000.0
126         Berger   Harriet      NaN   Philadelphia    PA       19129  5000.0
149          Block    Milton      NaN         Naples    NY       14512   200.0
400        Donelan     Myrna      NaN         Durham    NC  27707-5711   250.0
460          Faber   Suzanne      NaN        Chicago    IL       60611  5000.0
491        Fizdale   Richard      NaN        Chicago    IL       60611  5000.0
519        Fritsch   Claudia      NaN        Atlanta    GA       30319   250.0
543        Gaylord   Marilyn      NaN          Lacey    WA  98503-2547    50.0
566        Gilbert   Barbara      NaN  Nicholasville    KY       40356   100.0
608         Graves     Scott      NaN      Arlington    VA       22201    50.0
619      Griesbach     Marga      NaN     Silverdale    WA       98383   200.0
653         Hansen       Tom      NaN   Blue Springs    MO       64015   100.0
756       Ilyinsky   Michael      NaN     Cincinnati    OH       45243   250.0
915         Lawson     Peter      NaN    Valley Ford    CA  94972-0563   200.0
960            Low     Dixon      NaN        Roanoke    VA       24018   250.0
988        Manilow     Lewis      NaN        Chicago    IL       60610  5000.0
995   Mardirossian  Marianne      NaN        Potomac    MD       20859  5000.0
1057      Mcmorris    Bertha      NaN        Chicago    IL       60637  5000.0
1124        Nadeau      Bart      NaN  San Francisco    CA       94131   200.0
1226      Peterson     James      NaN        Shawnee    KS       66216   250.0
1311    Richardson       Jon      NaN           York    ME       03909   200.0
1362          Ryan   Melanie      NaN        Gahanna    OH       43230   100.0
1416         Seyal      Sara      NaN       Prospect    KY       40059   100.0
1459       Skinner     Nancy      NaN  Newport Beach    CA       92660    50.0
1621    Vail Aycox    Leslie      NaN     Alpharetta    GA       30022  5000.0
1689       Welters  Beatrice      NaN         Mclean    VA       22101  5000.0
1704      White Jr     Frank      NaN  Silver Spring    MD       20904  5000.0
1707       Whitney      John      NaN    Los Angeles    CA       90035   200.0
1713         Wilde  Margaret      NaN       Eatonton    GA       31024   500.0
1718        Willis      Mary      NaN        Langley    WA       98260   200.0
1736          Wolf   Michael      NaN       New York    NY       10013  5000.0
1772    Zschiesche     Peter      NaN      San Diego    CA       92104   250.0
1773    Zweidinger      Ruth      NaN   Hillsborough    NC       27278   250.0

### Drop all rows with missing information

- The `.dropna()` function allows you to use the `how` argument to specify whether you want to drop rows that have **ANY** null values, or rows that consist of **ALL** null values.

In [27]:
df = df.dropna(how='any')

### Verify dropped rows

In [28]:
df.count()

LastName     1743
FirstName    1743
Employer     1743
City         1743
State        1743
Zip          1743
Amount       1743
dtype: int64

### Display an overview of the *Employer* column

In [29]:
df['Employer'].value_counts().head(10)

None                        249
Self                        241
Retired                     126
Self Employed                39
Self-Employed                34
Google                        6
Unemployed                    4
Not Employed                  4
Bank Of America               3
University of California      3
Name: Employer, dtype: int64

### Clean up *Employer* category. Replace 'Self Employed' and 'Self' with 'Self-Employed'

In [30]:
df['Employer'] = df['Employer'].replace({'Self Employed': 'Self-Employed', 'Self': 'Self-Employed'})

### Verify the cleanup

In [31]:
df['Employer'].value_counts().head(10)

Self-Employed                     314
None                              249
Retired                           126
Google                              6
Not Employed                        4
Unemployed                          4
Social Security Administration      3
University of California            3
Bank Of America                     3
Ariel Investments                   2
Name: Employer, dtype: int64

### Clean up variations of *"Unemployed"*

In [32]:
df['Employer'] = df['Employer'].replace({'Not Employed': 'Unemployed'})
df['Employer'].value_counts().head(10)

Self-Employed                     314
None                              249
Retired                           126
Unemployed                          8
Google                              6
University of California            3
Bank Of America                     3
Social Security Administration      3
United Health Group                 2
Mayer Brown LLP                     2
Name: Employer, dtype: int64

### Display a statistical overview of the Amount

In [33]:
# We can infer the maximum allowable individual contribution from 'max'
df.describe()

            Amount
count  1743.000000
mean    640.124750
std    1242.343265
min       5.000000
25%     200.000000
50%     250.000000
75%     500.000000
max    5000.000000